lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_XMC4500.c
/*------------------------------------------------------------------------------
 *      RL-ARM - CAN
 *------------------------------------------------------------------------------
 *      Name:    CAN_XMC4500.c
 *      Purpose: CAN Driver, Hardware specific module for Infineon XMC4500
 *      Rev.:    V4.70
 *------------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/

#include <RTL.h>                        /* RTX kernel functions & defines     */
#include <RTX_CAN.h>                    /* CAN Generic functions & defines    */
#include <XMC4500.h>


/************************* CAN Hardware Configuration *************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o0> MultiCAN Module Clock (in Hz) <1-1000000000>
//     <i> System Core Clock divided by 12
#define CAN_CLK               10000000

// *** <<< End of Configuration section             >>> ***


/*------------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *------------------------------------------------------------------------------
 * Functions implemented in this module and used externally:
 *         CAN_ERROR CAN_hw_testmode    (U32 ctrl, U32 testmode);
 *         CAN_ERROR CAN_hw_setup       (U32 ctrl);
 *         CAN_ERROR CAN_hw_init        (U32 ctrl, U32 baudrate);
 *         CAN_ERROR CAN_hw_start       (U32 ctrl);
 *         CAN_ERROR CAN_hw_tx_empty    (U32 ctrl);
 *         CAN_ERROR CAN_hw_wr          (U32 ctrl, CAN_msg *msg);
 *         CAN_ERROR CAN_hw_set         (U32 ctrl, CAN_msg *msg);
 *         CAN_ERROR CAN_hw_rx_object   (U32 ctrl, U32 ch, U32 id, U32 object_para);
 *         CAN_ERROR CAN_hw_tx_object   (U32 ctrl, U32 ch,         U32 object_para);
 *----------------------------------------------------------------------------*/

/* Definitions                                                                */
#define MAX_CTRL   3
#define MAX_CH    64

/* Pointers to CAN controllers structures                                     */
CAN_NODE_TypeDef *CAN_NODE[] = { CAN_NODE0, CAN_NODE1, CAN_NODE2 };
CAN_MO_TypeDef   *CAN_MO  [] = { CAN_MO0,  CAN_MO1,  CAN_MO2,  CAN_MO3, 
                                 CAN_MO4,  CAN_MO5,  CAN_MO6,  CAN_MO7, 
                                 CAN_MO8,  CAN_MO9,  CAN_MO10, CAN_MO11, 
                                 CAN_MO12, CAN_MO13, CAN_MO14, CAN_MO15, 
                                 CAN_MO16, CAN_MO17, CAN_MO18, CAN_MO19, 
                                 CAN_MO20, CAN_MO21, CAN_MO22, CAN_MO23, 
                                 CAN_MO24, CAN_MO25, CAN_MO26, CAN_MO27, 
                                 CAN_MO28, CAN_MO29, CAN_MO30, CAN_MO31, 
                                 CAN_MO32, CAN_MO33, CAN_MO34, CAN_MO35, 
                                 CAN_MO36, CAN_MO37, CAN_MO38, CAN_MO39, 
                                 CAN_MO40, CAN_MO41, CAN_MO42, CAN_MO43, 
                                 CAN_MO44, CAN_MO45, CAN_MO46, CAN_MO47, 
                                 CAN_MO48, CAN_MO49, CAN_MO50, CAN_MO51, 
                                 CAN_MO52, CAN_MO53, CAN_MO54, CAN_MO55, 
                                 CAN_MO56, CAN_MO57, CAN_MO58, CAN_MO59, 
                                 CAN_MO60, CAN_MO61, CAN_MO62, CAN_MO63 };

/* Global variables                                                           */
U32 tx_mo  [3][2] = { 0 };              /* Object used for tramsnitting       */
U32 set_mo [3][2] = { 0 };              /* Objects handling rcv RTR send DATA */
U32 get_mo [3][2] = { 0 };              /* Objects handling send RTR get DATA */


/************************* Auxiliary Functions ********************************/

/*--------------------------- CAN_set_timing -----------------------------------
 *
 *  Setup the CAN timing with specific parameters
 *  Bit time looks like below:
 *  /--------------|--------------------------------------|-------------------\
 *  | sync seg = 1 |                tseg1                 |       tseg2       | 
 *  \--------------|--------------------------------------|-------------------/
 *  <-------------------- around 70 % ------------------->|<-- around 30 % -->
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              brp:        Baud Rate Prescaler
 *              tseg1:      Specifies Time Segment, including propagation 
 *                          segment, before the sample point (in time quanta) 
 *              tseg2:      Time Segment after the sample point (in time quanta)
 *
 *  Return:                 __TRUE = success, __FALSE = fail
 *----------------------------------------------------------------------------*/

static BOOL CAN_set_timing (U32 ctrl, U32 brp, U32 tseg1, U32 tseg2) {
  CAN_NODE_TypeDef *CAN_NODEx = CAN_NODE[ctrl-1];
  U32 div8 = 0;
  U32 sjw;

  /* Check input parameters are in expected boundaries                        */
  if ((!brp)      || (brp     > 512)  || 
      (tseg1 < 2) || (tseg1   >  15)  || 
      (tseg2 < 1) || (tseg2   >   7))  {
    return (__FALSE);
  }

  /* Calculate other needed values                                            */
  sjw = ((1 + tseg1) < tseg2) ? (1 + tseg1) : (tseg2);
  if (sjw > 4)  sjw = 4;
  if (!sjw)     sjw = 1;

  if (brp > 64) {
    div8 = 1;
    brp /= 8;
  }

  CAN_NODEx->NBTR  =  0;                /* Clear Bit Timing Register          */
  CAN_NODEx->NBTR |= ( div8     << 15) |/* Configure Bit Timing Register      */
                     ((tseg2-1) << 12) |
                     ((tseg1-1) <<  8) |
                     ((sjw  -1) <<  6) |
                     ((brp  -1) <<  0) ;

  return (__TRUE);
}


/*------------------------ CAN_hw_set_baudrate ---------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {

