lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_XMC4500.c
  /* Prepare values so that sample point is at about 70% from bit start
     TSEG1, TSEG2 are values that should be written into register, 
     these values are used with + 1 for timing values
     TSEG1    = 5 (tseg1    = TSEG1    + 1),  \
     TSEG2    = 2 (tseg2    = TSEG2    + 1),  - => 1 CAN bit = 10 TQ, sample at 70%
     sample point = ((1+tseg1)/(1+tseg1+tseg2)) * 100%        

    /--------------|--------------------------------------|-------------------\
    | sync seg = 1 |             tseg1 = 6                |    tseg2 = 3      | 
    \--------------|--------------------------------------|-------------------/
    <------------------------ 70 % ---------------------->|<------ 30 % ----->
  */

  if (!CAN_set_timing (ctrl, CAN_CLK / 10 / baudrate, 6, 3)) 
    return CAN_BAUDRATE_ERROR;

  return CAN_OK;
}


/*************************** Module Functions *********************************/

/*--------------------------- CAN_hw_setup -------------------------------------
 *
 *  Setup CAN clocks, transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {
  CAN_NODE_TypeDef *CAN_NODEx = CAN_NODE[ctrl-1];
  static U32 clk_set = 0;

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  if (!clk_set) {                       /* Set clock to module only once      */
    SCU_RESET->PRCLR1 = 1 << 4;         /* MultiCAN Reset Clear               */
    CAN->CLC &= ~1;                     /* Enable Module                      */
    while (CAN->CLC & 2);               /* Wait until module is enabled       */
    CAN->FDR  =  0;                     /* Clear FDR                          */
    CAN->FDR |= (1 << 14) | (1012);     /* fCAN = fSYS / (1024 -1012) = 10 MHz*/
    clk_set   =  1;
  }

  /* It is necessary to set CCE bit prior selecting transmit/receive ports    */
  CAN_NODEx->NCR |=  (1 << 6);          /* Configuration Change Enable, CCE=1 */

  switch (ctrl) {
    case 1:
      #if USE_CAN_CTRL1 == 1

        /* Setup CAN0 pins                                                    */
        /* Possible pins: 
           CAN0_TXDC0  - P0.0, P1.4, P3.2, P3.10 
           CAN0_RXDC0A - P1.5
           CAN0_RXDC0B - P14.3
           CAN0_RXDC0C - P3.12                                                */

        /* Enable CAN0 interrupt                                              */
        NVIC_SetPriority (CAN0_1_IRQn, 1);
        NVIC_EnableIRQ   (CAN0_1_IRQn);
      #endif
      break;

    case 2: 
      #if USE_CAN_CTRL2 == 1
        /* Setup CAN1 pins                                                    */
        /* Possible pins: 
           CAN1_TXDC1  - P3.9, P2.7, P1.12, P1.5
           CAN1_RXDC1A - P2.6
           CAN1_RXDC1B - P3.11
           CAN1_RXDC1C - P1.13
           CAN1_RXDC1D - P1.4
           CAN1_RXDC1F - CAN0INS                                              */

        /* Enable CAN1 interrupt                                              */
        NVIC_SetPriority (CAN0_2_IRQn, 1);
        NVIC_EnableIRQ   (CAN0_2_IRQn);
      #endif
      break;

    case 3: 
      #if USE_CAN_CTRL3 == 1
        /* Setup CAN2 pins                                                    */
        /* Possible pins: 
           CAN2_TXDC2  - P3.7, P1.9, P4.7
           CAN2_RXDC2A - P1.8
           CAN2_RXDC2B - P3.8
           CAN2_RXDC2C - P4.6
           CAN2_RXDC2F - CAN1INS                                              */

        /* Setup P1.9 as CAN_TX pin                                           */
        PORT1->IOCR8  &=  ~(0xFFUL <<  8);  /* Clear P1.9 settings            */
        PORT1->IOCR8  |=   (0x12UL << 11);  /* P1.9 output ALT2 push-pull     */
        PORT1->PDR1   &=  ~(0x07UL << 4);   /* Clear P1.9 output settings     */
        PORT1->PDR1   |=   (0x02UL << 4);   /* P1.9 output strong             */

        /* Setup P1.8 as CAN_RX pin                                           */
        PORT1->IOCR8  &=  ~(0xFFUL << 0);   /* Clear P1.8 settings            */
        PORT1->IOCR8  |=   (0x00UL << 0);   /* P1.8 input no pull device      */
        CAN_NODEx->NPCR &= ~7;              /* Select CAN2_RXDC2A as CAN2_RX  */

        /* Enable CAN2 interrupt                                              */
        NVIC_SetPriority (CAN0_3_IRQn, 1);
        NVIC_EnableIRQ   (CAN0_3_IRQn);
      #endif
      break;
  }

  CAN_NODEx->NCR &= ~(1 << 6);          /* Configuration Change Disable, CCE=0*/

  return CAN_OK;
}

/*--------------------------- CAN_hw_init --------------------------------------
 *
 *  Initialize the CAN hardware
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_init (U32 ctrl, U32 baudrate)  {
  CAN_NODE_TypeDef *CAN_NODEx = CAN_NODE[ctrl-1];

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  CAN_NODEx->NCR  |=  ((1 << 0) |       /* Node initialization, INIT = 1      */
                       (1 << 6));       /* Configuration Change Enable, CCE=1 */
  CAN_NODEx->NIPR &=  ~(7 << 8) ;       /* Clear TRINP field                  */
  CAN_NODEx->NIPR |=   (ctrl << 8);     /* Select INT_0(ctrl) for transfer int*/

  if (CAN_hw_set_baudrate(ctrl, baudrate) != CAN_OK)         /* Set baudrate  */
    return CAN_BAUDRATE_ERROR;

                                        /* Clear all message object bit masks */
  tx_mo [ctrl-1][0] = 0;
  tx_mo [ctrl-1][1] = 0;
  set_mo[ctrl-1][0] = 0;
  set_mo[ctrl-1][1] = 0;
  get_mo[ctrl-1][0] = 0;
  get_mo[ctrl-1][1] = 0;

  while (CAN->PANCTR & (1 << 8));       /* Wait for RAM init to finish        */

  CAN->MCR    &= ~(0x0F << 12);         /* MPSEL = 0000B - allocation case 1  */
  CAN->MSIMASK =   0xFFFFFFFF;          /* Enable all messages                */
  
  return CAN_OK;
}


/*--------------------------- CAN_hw_start -------------------------------------
 *
 *  Enable the CAN controller
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

