lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_XMC4500.c
CAN_ERROR CAN_hw_start (U32 ctrl)  {
  CAN_NODE_TypeDef *CAN_NODEx = CAN_NODE[ctrl-1];

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  CAN_NODEx->NCR &= ~((1 << 0) |        /* Node not in init, INIT = 0         */
                      (1 << 6));        /* Configuration Change Disable, CCE=0*/
  CAN_NODEx->NCR |=   (1 << 1) ;        /* Transmit Interrupt Enable, TRIE = 1*/

  return CAN_OK;
}

/*--------------------------- CAN_set_testmode ---------------------------------
 *
 *  Enable the CAN testmode
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              testmode:   Test mode (loopback bit value)
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_testmode (U32 ctrl, U32 testmode) {
  CAN_NODE_TypeDef *CAN_NODEx = CAN_NODE[ctrl-1];

  /* NOTE: in this case test mode does not work on one node, so 1 node can not 
           send and receive it's own message only test mode could work between 
           different nodes in same conttroller                                */

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  CAN_NODEx->NPCR &= ~(            1  << 8);
  CAN_NODEx->NPCR |=  ((testmode & 1) << 8);

  return CAN_OK;
}

/*--------------------------- CAN_hw_tx_empty ----------------------------------
 *
 *  Check if controller is available for transmission
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_empty (U32 ctrl)  {

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  if ((os_sem_wait (wr_sem[ctrl-1], 0) != OS_R_TMO)){ /* If semaphore is free */
    return CAN_OK;
  }

  return CAN_TX_BUSY_ERROR;
}


/*--------------------------- CAN_hw_wr ----------------------------------------
 *
 *  Write CAN_msg to the hardware registers of the requested controller
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              msg:        Pointer to CAN message to be written to hardware
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_wr (U32 ctrl, CAN_msg *msg)  {
  CAN_MO_TypeDef *CAN_MOx = CAN_MO[msg->ch-1];
  BOOL rmt;
  BOOL std;
  U8   mo_idx, msk;

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  if (msg->ch > MAX_CH) 
    return CAN_UNEXIST_CH_ERROR;

  rmt = (msg->type   == REMOTE_FRAME);
  std = (msg->format == STANDARD_FORMAT);

  /* Setup Message Object for transmission                                    */

  /* Setup the identifier information                                         */
  if (std)  {                                              /* Standard ID     */
    CAN_MOx->MOAMR = (2UL << 30) |             (U32)(msg->id << 18);
    CAN_MOx->MOAR  = (2UL << 30) |             (U32)(msg->id << 18);
  }  else  {                                               /* Extended ID     */
    CAN_MOx->MOAMR = (2UL << 30) | (1 << 29) | (U32)(msg->id);
    CAN_MOx->MOAR  = (2UL << 30) | (1 << 29) | (U32)(msg->id);
  }

  /* Setup data bytes                                                         */
  CAN_MOx->MODATAL = ((U32)msg->data[3] << 24) | 
                     ((U32)msg->data[2] << 16) | 
                     ((U32)msg->data[1] <<  8) | 
                     ((U32)msg->data[0]      ) ;
  CAN_MOx->MODATAH = ((U32)msg->data[7] << 24) | 
                     ((U32)msg->data[6] << 16) | 
                     ((U32)msg->data[5] <<  8) | 
                     ((U32)msg->data[4]      ) ;

  CAN_MOx->MOFCR   = (msg->len << 24) | /* DLC  = Data Length                 */
                    (( rmt) << 21) |    /* RMM  = 1 for Remote Monitoring     */
                    (( rmt) << 16) |    /* RXIE = 1 for DATA answer receive   */
                     (   1  << 17) |    /* TXIE = 1 -> Transmit Interrupt En  */
                     (   0  <<  0) ;    /* MMC  = 0 -> Standard Message Object*/

                                        /* Update object bit mask             */
  mo_idx = ((msg->ch-1) >> 5) & 1;
  msk    = (1 << ((msg->ch-1) & 0x1F));
  set_mo[ctrl-1][mo_idx] &=~msk;        /* It is not SET object               */
  if (rmt) 
    get_mo[ctrl-1][mo_idx] |=  msk;     /* If RTR tx requested then it's GET  */

  /* Activate transmission                                                    */
  CAN_MOx->MOCTR   = (    1  <<  6) |   /* Clear RTSEL                        */
                     ((!rmt) <<  7) |   /* Clear RXEN for DATA sending        */
                     (( rmt) << 11) |   /* Clear DIR for RTR sending          */
                     (    1  << 19) |   /* Set NEWDAT                         */
                     (    1  << 21) |   /* Set MSGVAL                         */
                     (( rmt) << 23) |   /* Set RXEN for RTR sending           */
                     (    1  << 24) |   /* Set TXRQ                           */
                     (    1  << 25) |   /* Set TXEN0                          */
                     (    1  << 26) |   /* Set TXEN1                          */
                     ((!rmt) << 27);    /* Set DIR for DATA sending           */

  return CAN_OK;
}


/*--------------------------- CAN_hw_rd ----------------------------------------
 *
 *  Read CAN_msg from the hardware registers of the requested controller
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              ch:         Index of object used for reception
 *              msg:        Pointer where CAN message will be read
 *
 *  Return:     none
 *----------------------------------------------------------------------------*/

static void CAN_hw_rd (U32 ctrl, U32 ch, CAN_msg *msg)  {
  CAN_MO_TypeDef *CAN_MOx = CAN_MO[ch-1];

  /* Read identifier information                                              */
  if (!(CAN_MOx->MOAR & (1 << 29))) {                       /* Standard ID    */
    msg->format =  STANDARD_FORMAT;
    msg->id     =  0x000007FFUL & (CAN_MOx->MOAR >> 18);
  }  else  {                                                /* Extended ID    */
    msg->format =  EXTENDED_FORMAT;
    msg->id     =  0x1FFFFFFFUL & CAN_MOx->MOAR;
  }

  /* Read type information                                                    */
  msg->type     =  DATA_FRAME;                              /* DATA   FRAME   */

  /* Read length (number of received bytes)                                   */
  msg->len      = (CAN_MOx->MOFCR >> 24) & 0x0F;

  /* Read data bytes                                                          */
  msg->data[0]  = (CAN_MOx->MODATAL      );
  msg->data[1]  = (CAN_MOx->MODATAL >>  8);
  msg->data[2]  = (CAN_MOx->MODATAL >> 16);
  msg->data[3]  = (CAN_MOx->MODATAL >> 24);
  msg->data[4]  = (CAN_MOx->MODATAH      );
  msg->data[5]  = (CAN_MOx->MODATAH >>  8);
  msg->data[6]  = (CAN_MOx->MODATAH >> 16);
  msg->data[7]  = (CAN_MOx->MODATAH >> 24);

  CAN_MOx->MOCTR = (1 <<  3);           /* Reset NEWDAT                       */
}


