lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_XMC4500.c
/*--------------------------- CAN_hw_set ---------------------------------------
 *  Set a message that will automatically be sent as an answer to the REMOTE
 *  FRAME message
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              msg:        Pointer to CAN message to be set
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_set (U32 ctrl, CAN_msg *msg)  {
  CAN_MO_TypeDef *CAN_MOx = CAN_MO[msg->ch-1];
  BOOL std;
  U8   mo_idx, msk;

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  if (msg->ch > MAX_CH) 
    return CAN_UNEXIST_CH_ERROR;

  std = (msg->format == STANDARD_FORMAT);

  /* Setup Message Object for transmission                                    */

  /* Setup the identifier information                                         */
  if (std)  {                                              /* Standard ID     */
    CAN_MOx->MOAMR = (2UL << 30) |             (U32)(msg->id << 18);
    CAN_MOx->MOAR  = (2UL << 30) |             (U32)(msg->id << 18);
  }  else  {                                               /* Extended ID     */
    CAN_MOx->MOAMR = (2UL << 30) | (1 << 29) | (U32)(msg->id);
    CAN_MOx->MOAR  = (2UL << 30) | (1 << 29) | (U32)(msg->id);
  }

  /* Setup data bytes                                                         */
  CAN_MOx->MODATAL = ((U32)msg->data[3] << 24) | 
                     ((U32)msg->data[2] << 16) | 
                     ((U32)msg->data[1] <<  8) | 
                     ((U32)msg->data[0]      ) ;
  CAN_MOx->MODATAH = ((U32)msg->data[7] << 24) | 
                     ((U32)msg->data[6] << 16) | 
                     ((U32)msg->data[5] <<  8) | 
                     ((U32)msg->data[4]      ) ;

  CAN_MOx->MOFCR   = (msg->len << 24) | /* DLC  = Data Length                 */
                     (1 << 21) |        /* RMM  = 1 for Remote Monitoring     */
                     (1 << 16) |        /* RXIE = 1 for DATA answer receive   */
                     (1 << 17) |        /* TXIE = 1 for DATA answer send      */
                     (0 <<  0) ;        /* MMC  = 0 -> Standard Message Object*/

                                        /* Update object bit mask             */
  mo_idx = ((msg->ch-1) >> 5) & 1;
  msk    = (1 << ((msg->ch-1) & 0x1F));
  get_mo[ctrl-1][mo_idx] &= ~msk;       /* It is not GET object               */
  set_mo[ctrl-1][mo_idx] |=  msk;       /* It is SET object                   */

  /* Activate reception of RTR                                                */
  CAN_MOx->MOCTR   = (1 <<  6) |        /* Clear RTSEL                        */
                     (1 <<  8) |        /* Clear TXRQ, auto set on RTR rcv    */
                     (1 << 19) |        /* Set NEWDAT                         */
                     (1 << 21) |        /* Set MSGVAL                         */
                     (1 << 23) |        /* Set RXEN                           */
                     (1 << 25) |        /* Set TXEN0                          */
                     (1 << 26) |        /* Set TXEN1                          */
                     (1 << 27) ;        /* Set DIR for RTR reception          */

  return CAN_OK;
}


/*--------------------------- CAN_hw_rx_object ---------------------------------
 *
 *  This function setups object that is going to be used for the message 
 *  reception
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              ch:         Index of object used for reception
 *              id:         Identifier of receiving messages
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_rx_object (U32 ctrl, U32 ch, U32 id, U32 object_para)  {
  CAN_MO_TypeDef *CAN_MOx = CAN_MO[ch-1];
  BOOL std;
  U8   mo_idx, msk;

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  if (ch > MAX_CH) 
    return CAN_UNEXIST_CH_ERROR;

  std = (object_para & FORMAT_TYPE) == STANDARD_TYPE;

  while (CAN->PANCTR & (3 << 8));       /* While BUSY or RBUSY are active     */

  CAN->PANCTR  = ((ctrl) << 24) |       /* Statically allocate obj to list    */
                 ((ch-1) << 16) |
                 ((0x02) <<  0) ;

  while (CAN->PANCTR & (3 << 8));       /* While BUSY or RBUSY are active     */

  /* Setup Message Object for reception                                       */

  CAN_MOx->MOFCR &= ~0x0F;              /* Message Mode Control = Std Object  */

  /* Setup the identifier information                                         */
  if (std)  {                                              /* Standard ID     */
    CAN_MOx->MOAMR =             (U32)(id << 18);
    CAN_MOx->MOAR  =             (U32)(id << 18);
  }  else  {                                               /* Extended ID     */
    CAN_MOx->MOAMR = (1 << 29) | (U32)(id);
    CAN_MOx->MOAR  = (1 << 29) | (U32)(id);
  }

                                        /* Update object bit mask             */
  mo_idx = ((ch-1) >> 5) & 1;
  msk    = (1 << ((ch-1) & 0x1F));
  tx_mo [ctrl-1][mo_idx] &= ~msk;       /* Clear TX so it is RX object        */
  set_mo[ctrl-1][mo_idx] &= ~msk;       /* It is not SET object               */
  get_mo[ctrl-1][mo_idx] &= ~msk;       /* It is not GET object               */

                                        /* Enable RX object to trigger INT_0n */
                                        /* where n is controller index        */
  CAN_MOx->MOIPR  &= ~0xFFFFFFFF;       /* Clear MOIPR                        */
  CAN_MOx->MOIPR  |= ((ctrl - 1)<< 14)| /* Bits 15..14 of MPN   in MOIPR      */
                     ((ch >  32)<< 13)| /* Bit  13     of MPN   in MOIPR      */
                     (((ch-1)&0x1F)<<8)|/* Bits 12.. 8 of MPN   in MOIPR      */
                     ((ctrl)         ); /* Bits 3 .. 0 of RXINP in MOIPR      */
  CAN_MOx->MOFCR  |=  1 << 16;          /* Receive Interrupt Enable           */

