lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_XMC4500.c
  /* Activate reception                                                       */
  CAN_MOx->MOCTR   = (1 <<  3) |        /* Clear NEWDAT                       */
                     (1 <<  6) |        /* Clear RTSEL                        */
                     (7 <<  8) |        /* Clear TXRQ, TXEN0, TXEN1           */
                     (1 << 11) |        /* Clear DIR                          */
                     (1 << 21) |        /* Set MSGVAL                         */
                     (1 << 23) ;        /* Set RXEN                           */

  return CAN_OK;
}

/*--------------------------- CAN_hw_tx_object ---------------------------------
 *
 *  This function setups object that is going to be used for the message 
 *  transmission, the setup of transmission object is not necessery so this 
 *  function is not implemented
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              ch:         Index of object used for transmission
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     CAN_ERROR:  Error code
 *----------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_object (U32 ctrl, U32 ch, U32 object_para)  {
  CAN_MO_TypeDef *CAN_MOx = CAN_MO[ch-1];
  U8   mo_idx, msk;

  if (ctrl > MAX_CTRL) 
    return CAN_UNEXIST_CTRL_ERROR;

  if (ch > MAX_CH) 
    return CAN_UNEXIST_CH_ERROR;

  while (CAN->PANCTR & (3 << 8));       /* While BUSY or RBUSY are active     */

  CAN->PANCTR  = ((ctrl) << 24) |       /* Statically allocate obj to list    */
                 ((ch-1) << 16) |
                 ((0x02) <<  0) ;

  while (CAN->PANCTR & (3 << 8));       /* While BUSY or RBUSY are active     */

  /* Setup Message Object for transmission                                    */
                                        /* Update object bit mask             */
  mo_idx = ((ch-1) >> 5) & 1;
  msk    = (1 << ((ch-1) & 0x1F));
  tx_mo [ctrl-1][mo_idx] |=  msk;       /* It is TX object                    */
  set_mo[ctrl-1][mo_idx] &= ~msk;       /* It is not SET object               */
  get_mo[ctrl-1][mo_idx] &= ~msk;       /* It is not GET object               */

                                        /* Enable TX object to trigger INT_0n */
                                        /* where n is controller index        */
  CAN_MOx->MOIPR  &= ~0xFFFFFFFF;       /* Clear MOIPR                        */
  CAN_MOx->MOIPR  |= ((ctrl - 1)<< 14)| /* Bits 15..14 of MPN   in MOIPR      */
                     ((ch >  32)<< 13)| /* Bit  13     of MPN   in MOIPR      */
                     (((ch-1)&0x1F)<<8)|/* Bits 12.. 8 of MPN   in MOIPR      */
                     ((ctrl)    <<  4); /* Bits 6 .. 4 of TXINP in MOIPR      */

  return CAN_NOT_IMPLEMENTED_ERROR;
}


/************************* Interrupt Functions ********************************/

/*--------------------------- CANx_IRQHandler ----------------------------------
 *
 *  CAN interrupt functions 
 *  If transmit interrupt occured and there are messages in mailbox for 
 *  transmit it writes it to hardware and starts the transmission
 *  If receive interrupt occured it reads message from hardware registers 
 *  and puts it into receive mailbox
 *----------------------------------------------------------------------------*/

#define CTRL                  1
#define K                     0

void CAN0_1_IRQHandler (void) {
  CAN_msg *ptrmsg;
  U32      mspndk;
  U32      mspndk1;
  U32      mostat;
  U8       k, idx, mo_grp, mo_idx, tx, set, get;

  mspndk  = CAN->MSPND[K];
  mspndk1 = CAN->MSPND[K+1];
  while (mspndk | mspndk1) {
    k  = K;
    tx = 0;
    if (mspndk) {
      idx    = CAN->MSID[K];
      mo_grp = 0;
    } else {
      k      = K+1;
      idx    = CAN->MSID[K+1];
      mo_grp = 1;
    }
    tx     = (tx_mo [CTRL-1][mo_grp] >> idx) & 1;
    set    = (set_mo[CTRL-1][mo_grp] >> idx) & 1;
    get    = (get_mo[CTRL-1][mo_grp] >> idx) & 1;
    mo_idx = (mo_grp << 5) + idx;
    mostat = CAN_MO[mo_idx]->MOSTAT;

    if ((tx || get || set) && (mostat & 2)) {     /* If tx interrupt          */
      CAN_MO[mo_idx]->MOCTR = (1 <<  1);/* Clear TXPND                        */

      /* If there is a message in the mailbox ready for send, read the 
         message from the mailbox and send it                                 */
      if (isr_mbx_receive (MBX_tx_ctrl[CTRL-1], (void **)&ptrmsg) != OS_R_OK) {
        CAN_hw_wr (CTRL, ptrmsg);
        _free_box(CAN_mpool, ptrmsg);
      } else {
        isr_sem_send(wr_sem[CTRL-1]);   /* Return a token back to semaphore   */
      }
    } 
    if ((!tx || get || set) && (mostat & 1)) {    /* If rx interrupt          */
      if (!set) {
        /* If the mailbox isn't full read the message from the hardware and
           send it to the message queue otherwise dump the rceived message    */
        if (isr_mbx_check (MBX_rx_ctrl[CTRL-1]) > 0)  {
          ptrmsg = _alloc_box (CAN_mpool);
          if (ptrmsg) {
            CAN_hw_rd (CTRL, mo_idx+1, ptrmsg);   /* Read received message    */
            isr_mbx_send (MBX_rx_ctrl[CTRL-1], ptrmsg);
          }
        }
      }
      CAN_MO[mo_idx]->MOCTR = (1 <<  0);/* Clear RXPND                        */
    }

    CAN->MSPND[k] &= ~(1 << idx);       /* Clear pending interrupt            */
    mspndk  = CAN->MSPND[K];
    mspndk1 = CAN->MSPND[K+1];
  }
}


#undef  CTRL
#define CTRL                  2
#undef  K
#define K                     2

void CAN0_2_IRQHandler (void) {
  CAN_msg *ptrmsg;
  U32      mspndk;
  U32      mspndk1;
  U32      mostat;
  U8       k, idx, mo_grp, mo_idx, tx, set, get;

  mspndk  = CAN->MSPND[K];
  mspndk1 = CAN->MSPND[K+1];
  while (mspndk | mspndk1) {
    k  = K;
    tx = 0;
    if (mspndk) {
      idx    = CAN->MSID[K];
      mo_grp = 0;
    } else {
      k      = K+1;
      idx    = CAN->MSID[K+1];
      mo_grp = 1;
    }
    tx     = (tx_mo [CTRL-1][mo_grp] >> idx) & 1;
    set    = (set_mo[CTRL-1][mo_grp] >> idx) & 1;
    get    = (get_mo[CTRL-1][mo_grp] >> idx) & 1;
    mo_idx = (mo_grp << 5) + idx;
    mostat = CAN_MO[mo_idx]->MOSTAT;

    if ((tx || get || set) && (mostat & 2)) {     /* If tx interrupt          */
      CAN_MO[mo_idx]->MOCTR = (1 <<  1);/* Clear TXPND                        */

