lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_XMC4500.c
      /* If there is a message in the mailbox ready for send, read the 
         message from the mailbox and send it                                 */
      if (isr_mbx_receive (MBX_tx_ctrl[CTRL-1], (void **)&ptrmsg) != OS_R_OK) {
        CAN_hw_wr (CTRL, ptrmsg);
        _free_box(CAN_mpool, ptrmsg);
      } else {
        isr_sem_send(wr_sem[CTRL-1]);   /* Return a token back to semaphore   */
      }
    } 
    if ((!tx || get || set) && (mostat & 1)) {    /* If rx interrupt          */
      if (!set) {
        /* If the mailbox isn't full read the message from the hardware and
           send it to the message queue otherwise dump the rceived message    */
        if (isr_mbx_check (MBX_rx_ctrl[CTRL-1]) > 0)  {
          ptrmsg = _alloc_box (CAN_mpool);
          if (ptrmsg) {
            CAN_hw_rd (CTRL, mo_idx+1, ptrmsg);   /* Read received message    */
            isr_mbx_send (MBX_rx_ctrl[CTRL-1], ptrmsg);
          }
        }
      }
      CAN_MO[mo_idx]->MOCTR = (1 <<  0);/* Clear RXPND                        */
    }

    CAN->MSPND[k] &= ~(1 << idx);       /* Clear pending interrupt            */
    mspndk  = CAN->MSPND[K];
    mspndk1 = CAN->MSPND[K+1];
  }
}


#undef  CTRL
#define CTRL                  3
#undef  K
#define K                     4

void CAN0_3_IRQHandler (void) {
  CAN_msg *ptrmsg;
  U32      mspndk;
  U32      mspndk1;
  U32      mostat;
  U8       k, idx, mo_grp, mo_idx, tx, set, get;

  mspndk  = CAN->MSPND[K];
  mspndk1 = CAN->MSPND[K+1];
  while (mspndk | mspndk1) {
    k  = K;
    tx = 0;
    if (mspndk) {
      idx    = CAN->MSID[K];
      mo_grp = 0;
    } else {
      k      = K+1;
      idx    = CAN->MSID[K+1];
      mo_grp = 1;
    }
    tx     = (tx_mo [CTRL-1][mo_grp] >> idx) & 1;
    set    = (set_mo[CTRL-1][mo_grp] >> idx) & 1;
    get    = (get_mo[CTRL-1][mo_grp] >> idx) & 1;
    mo_idx = (mo_grp << 5) + idx;
    mostat = CAN_MO[mo_idx]->MOSTAT;

    if ((tx || get || set) && (mostat & 2)) {     /* If tx interrupt          */
      CAN_MO[mo_idx]->MOCTR = (1 <<  1);/* Clear TXPND                        */

      /* If there is a message in the mailbox ready for send, read the 
         message from the mailbox and send it                                 */
      if (isr_mbx_receive (MBX_tx_ctrl[CTRL-1], (void **)&ptrmsg) != OS_R_OK) {
        CAN_hw_wr (CTRL, ptrmsg);
        _free_box(CAN_mpool, ptrmsg);
      } else {
        isr_sem_send(wr_sem[CTRL-1]);   /* Return a token back to semaphore   */
      }
    } 
    if ((!tx || get || set) && (mostat & 1)) {    /* If rx interrupt          */
      if (!set) {
        /* If the mailbox isn't full read the message from the hardware and
           send it to the message queue otherwise dump the rceived message    */
        if (isr_mbx_check (MBX_rx_ctrl[CTRL-1]) > 0)  {
          ptrmsg = _alloc_box (CAN_mpool);
          if (ptrmsg) {
            CAN_hw_rd (CTRL, mo_idx+1, ptrmsg);   /* Read received message    */
            isr_mbx_send (MBX_rx_ctrl[CTRL-1], ptrmsg);
          }
        }
      }
      CAN_MO[mo_idx]->MOCTR = (1 <<  0);/* Clear RXPND                        */
    }

    CAN->MSPND[k] &= ~(1 << idx);       /* Clear pending interrupt            */
    mspndk  = CAN->MSPND[K];
    mspndk1 = CAN->MSPND[K+1];
  }
}


/*------------------------------------------------------------------------------
 * end of file
 *----------------------------------------------------------------------------*/

